Revit 2024 API
AnalyticalModelSelector Constructor
Overload List
Name | Description
AnalyticalModelSelector()
 Creates a selector for the analytical model geometry.
AnalyticalModelSelector(AnalyticalCurveSelector)
 Creates a selector for the analytical model geometry.
AnalyticalModelSelector(Curve)
 Creates a selector based on a specific analytical curve.
AnalyticalModelSelector(Curve, AnalyticalCurveSelector)
 Creates a selector based on one portion of a specific analytical curve.
See Also
AnalyticalModelSelector Class
AnalyticalModelSelector Members
Autodesk.Revit.DB.Structure Namespace